<script setup lang="ts">
definePageMeta({
  title: 'Корзина',
})
</script>

<template>
  <div
    bg-brand-primary
    border-18
    border-brand-primary
    flex
    flex-col
    gap-4
    rounded-10
    mb-2
  >
    <div bg-brand rounded-5 p-5>
      <div flex flex-col gap-5 items-center wrap-normal overflow-x-scroll h-169>
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав макси макси макси макси атимальных прав атакиальных"
        />
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав макси макси макси макси атимальных прав атакиальных"
        />
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав макси макси макси макси атимальных прав атакиальных"
        />
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав макси макси макси макси атимальных прав атакиальных"
        />
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав макси макси макси макси атимальных прав атакиальных"
        />
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав макси макси макси макси атимальных прав атакиальных"
        />

        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав
              атимальных прав атакиальных"
        />
        <BasketCard
          price="7800"
          title=" УУием ение макси ение максиммакс маение максиммаксмаммаксмас прав
              атимальных прав атакиальных"
        />
      </div>
    </div>
  </div>
</template>
